import Layout from '../components/layout';
// import './App.css';
// import { Route, Link } from 'react-router-dom';

function About() {
    return (
        <>
            <Layout>
                <h1>О Сервере</h1>
                <p>Доброго времени суток, уважаемый пользователь.</p>
                <p>Я постараюсь в двух словах описать историю нашего сервера, т.к если мой дорогой читатель, я буду описывать все аспекты, ты выпьешь слишком много кофе.</p>
                <p>Свой первый День Рожденья, сервер Golden World, отметил в 2008 году, а если быть точнее, то в так запомнившимся нам с детства месяце сентябрь.</p>
                <strong>О сервере :</strong>
                <ul>
                    <li>Технически - это классический пол, на базе 95 ядра;</li>
                    <li>Произвольный выбор расс;</li>
                    <li>Шесть классовых персонажей;</li>
                    <li>Левельная система;</li>
                    <li>Скилкап - 1200;</li>
                    <li>Статкап - 300 - 350;</li>
                    <li>Максимальный уровень - 6.</li>
                </ul>
                <p><strong>Наши цели :</strong><br/> Наша команда сразу определила свой основной приоритет - стабильность. От стабильности мы уверенными шагами продвигались дальше. Ultima, это основополагающая игра, своего рода прародитель всех онлайн игр. Приведу некую аналогию : Хороший ретро автомобиль - хороший только тогда, когда он в оригинале. Наша цель - отточить работу сервера так, что его работу можно будет сравнить разве что с Швейцарскими часами. Каждый скрипт - четко сбалансированная шестерёнка огромного механизма, работающего в гармонии его структуры.</p>
                <p><strong>О работе :</strong> Некоторый список изменений, проделанный нашей небольшой, но целеустремленной командой. Я ни буду расписывать мелкие исправления в скриптах и их настройку, приведу лишь основной список, где каждый скрипт был написан с нуля, максимально оптимизирован и успешно используется всеми игроками :</p>
                <ul type="square">
                    <li>Ветеринария</li>
                    <li>Рунабуки</li>
                    <li>Лодки</li>
                    <li>Дома</li>
                    <li>Детект</li>
                    <li>Трекинг</li>
                    <li>Кукинг</li>
                    <li>Телепорт</li>
                    <li>Марк</li>
                    <li>Рекол</li>
                    <li>Гейты</li>
                    <li>Фикс емптиконтейнера</li>
                    <li>Тотемы</li>
                    <li>Беггинг</li>
                </ul>
                <p><strong>Финансовая составляющая :</strong><br/> Сервер ни когда не являлся средством дохода, т.к как бы это не звучало, но суммы рентабельности Ультимы, на данный момент таковы, что мне стыдно их озвучить. Проще говоря, мы не нуждающиеся, и максимум что хотим от сервера, это окупить его ежемесячную амортизацию.</p>
                <p><strong>Авто квесты :</strong><br/> Некое новаторство для мира на 95 ядре. Да, у нас есть авто квесты, они призваны разнообразить рутину, с которой сталкивается практически каждый, кто решил начать игру с нуля. На данный момент система проста и понятна. Мы работаем в этом направлении и далее..</p>
                <p><strong>Менталитет и коммуникации :</strong><br/> Администрация сервера строго придерживается буквы закона, и любое решение представителя администрации, это объективно обоснованное мнение всего состава. В подавляющем большинстве, наши игроки умеют общаться, они помогают друг другу, помогают новеньким нюбикам. Не хочу показаться голословным, но это очень приятно, когда наблюдая из инвиза, видишь эти тёплые и дружеские отношения. Если же случилось непоправимое, взлом аккаунта, вынос персонажа, администрация прикладывает все возможные меры, дабы исправить ситуацию в пользу истца.</p>
                <p><strong>Наша команда :</strong><br/> Наша команда - это сплоченный и дружный коллектив единомышленников альтруистов. Представитель стафф команды - беспристрастный бот, руководствующийся сугубо настоящими правилами игры. Мы хорошо осознавали, что многие сервера теряли репутацию в следствии дискриминации со стороны стафф команды. Когда представитель стафф персонала превышает свои полномочия, и т.д.  Мы позиционируем себя не как иначе, а только как объективные и беспристрастные боты, работающие во благо серверу. Благодаря этому мы добились хороших результатов.</p>
                <p><strong>Новенькому :</strong><br/> Не слова делают человека, а дела. Заходи в гости к нам на сервер, осмотрись, а там уже решишь.<br/> В любом случае, мы радушно встретим тебя и твоих друзей.</p>
            </Layout>
        </>
    );
}

export default About;
